app/controllers/searches_controller.rb

SELECT "users".* FROM "users" WHERE "users"."name" = ?  [["name", "hjhkj"]]
SELECT COUNT(*) FROM "users" WHERE "users"."name" = ?  [["name", "hkjhkjhkj"]]
---
    def search
        #i = 0
        find = params[:search]
        if User.where(name: find).length != 0

SELECT "users".* FROM "users" WHERE "users"."name" = ?  [["name", "l"]]
---
   def result_search
    @users=User.where(name: params[:find])