app/controllers/users_controller.rb

def test
    @user=User.where(email:  params[:name]).first
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["email", "d@yahoo.com"]]

  def show
    #@autocomplete=User.find(params[:name]).first
  	@user= User.find(params[:id])
    @posts = Post.where(friend_id: @user.id)
    @my_friends = User.where(id: current_user.friendships.map{|v| [v.friend_id]})
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."friend_id" = ?  [["friend_id", 1]]
SELECT "friendships".* FROM "friendships" WHERE "friendships"."user_id" = ?  [["user_id", 1]]

  def friends
    @user= User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 36]]

  def create
    @user = User.find(params[:id])
    if @user.save
        UserMailer.registration_confirmation(@user).deliver
        flash[:success] = "Please confirm your email address to continue"
        redirect_to root_url
    else
        flash[:error] = "Ooooppss, something went wrong!"
        render 'new'
    end

    @post = Post.new
      @post.content = params[:content]
      @post.user_id = current_user.id
      @post.friend_id = @user.id
    @post.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
INSERT INTO "posts" ("content", "user_id", "friend_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "hello"], ["user_id", 1], ["friend_id", 6], ["created_at", "2015-10-06 10:06:27.364096"], ["updated_at", "2015-10-06 10:06:27.364096"]]

  def befriend
    @user = User.find(params[:id])
    friendship = Friendship.new
      friendship.user_id = current_user.id
      friendship.friend_id = @user.id
    friendship.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
INSERT INTO "friendships" ("user_id", "friend_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["friend_id", 6], ["created_at", "2015-10-06 10:06:15.936353"], ["updated_at", "2015-10-06 10:06:15.936353"]]